# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

n = int(input('Введите N: '))
k = 0 # степень
i = 0 # результат возведения в степень
while i < n:
    i = 2 ** k
    k+=1
    if i < n:
        print(i)