#  Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, 
#  а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть, 
#  чтобы все монетки были повернуты вверх одной и той же стороной. 
#  Выведите минимальное количество монет, которые нужно перевернуть

from random import randint

n = int(input('Введите количество мотет: '))
count = 0  
for i in range (1, n + 1):
    coin = randint(0, 1)
    print(coin)
    if coin == 0:
        count += 1

if count < n - count:
    print(f"Необходимо перевернуть  {count} монет(у).")
elif count > n - count:
    print(f"Необходимо перевернуть {n - count} монет(у)")
else:
    print(f"Необходимо перевернуть {n / 2} монет")



